INSERT INTO `index_index` (`code`,`native_code`,`isin`,`name`,`formula`,`region_id`,`market_id`,`subject_id`,`dt_created`,`dt_updated`)
VALUES
('CNSH1A0001','1A0001','','上证综指',null,156,'XSHG',null,'2020-11-10','2020-11-10'),
('CNSZ399001','399001','','深证成指',null,156,'XSHE',null,'2020-11-10','2020-11-10'),
('CNSH1B0688','1B0688','','科创50指数',null,156,'XSHG','XSHG-A-STAR','2020-11-10','2020-11-10'),
('CNSZ399006','399006','','创业板指数',null,156,'XSHE','XSHE-A-CHINEXT','2020-11-10','2020-11-10'),
('CNSZ399005','399005','','中小企业板指数',null,156,'XSHE','XSHE-A-SME','2020-11-10','2020-11-10'),
('HKHSI','HSI','','恒生指数',null,344,'XHKG',null,'2020-11-10','2020-11-10'),
('USIXIC','IXIC','US3159127097','纳斯达克综合指数',null,840,'XNAS',null,'2020-11-10','2020-11-10'),
('USNDX','NDX','US6311011026','纳斯达克100指数',null,840,'XNAS',null,'2020-11-10','2020-11-10'),
('USDJIA','DJIA','US2605661048','道琼斯工业平均指数',null,840,null,null,'2020-11-10','2020-11-10'),
('USSPX','SPX','US78378X1072','标准普尔500指数',null,840,null,null,'2020-11-10','2020-11-10'),
('CNXIN9','XIN9','','富时中国A50指数',null,156,null,null,'2020-11-10','2020-11-10'),
('USDXY','DXY','','美元指数',null,1,null,null,'2020-11-10','2020-11-10');
-- ('',null,'','主要国家货币供应量M2',null,null,null,null,'2020-11-10','2020-11-10'),
-- ('',null,'','主要国家存款准备金率',null,null,null,null,'2020-11-10','2020-11-10'),
-- ('',null,'','主要国家各类利率',null,null,null,null,'2020-11-10','2020-11-10'),
-- ('',null,'','国际市场大宗商品期货价格',null,null,null,null,'2020-11-10','2020-11-10'),
